; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-6-14)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	plane6 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	city11 - city
	city12 - city
	city13 - city
	city14 - city
	city15 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city8)
	(fuel-level plane1 fl5)
	(at plane2 city15)
	(fuel-level plane2 fl4)
	(at plane3 city4)
	(fuel-level plane3 fl0)
	(at plane4 city14)
	(fuel-level plane4 fl3)
	(at plane5 city6)
	(fuel-level plane5 fl2)
	(at plane6 city4)
	(fuel-level plane6 fl0)
	(at person1 city8)
	(at person2 city8)
	(at person3 city13)
	(at person4 city3)
	(at person5 city11)
	(at person6 city7)
	(at person7 city6)
	(at person8 city0)
	(at person9 city3)
	(at person10 city7)
	(at person11 city12)
	(at person12 city8)
	(at person13 city0)
	(at person14 city9)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane2 city4)
	(at plane3 city12)
	(at person1 city5)
	(at person2 city3)
	(at person3 city1)
	(at person4 city5)
	(at person5 city0)
	(at person6 city9)
	(at person7 city15)
	(at person8 city10)
	(at person9 city2)
	(at person10 city8)
	(at person11 city1)
	(at person12 city9)
	(at person13 city6)
	(at person14 city9)
	))

)

; plan
1. (board person7 plane5 city6)
   deleted: (at person7 city6)
   added: (in person7 plane5)
   goals met: 1 of 16
2. (zoom plane5 city6 city15 fl2 fl1 fl0)
   deleted: (at plane5 city6) (fuel-level plane5 fl2)
   added: (at plane5 city15) (fuel-level plane5 fl0)
   goals met: 1 of 16
3. (debark person7 plane5 city15)
   deleted: (in person7 plane5)
   added: (at person7 city15)
   goals met: 2 of 16
4. (refuel plane3 city4 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 2 of 16
5. (fly plane3 city4 city12 fl1 fl0)
   deleted: (at plane3 city4) (fuel-level plane3 fl1)
   added: (at plane3 city12) (fuel-level plane3 fl0)
   goals met: 3 of 16
6. (board person11 plane3 city12)
   deleted: (at person11 city12)
   added: (in person11 plane3)
   goals met: 3 of 16
7. (refuel plane3 city12 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 3 of 16
8. (zoom plane2 city15 city0 fl4 fl3 fl2)
   deleted: (at plane2 city15) (fuel-level plane2 fl4)
   added: (at plane2 city0) (fuel-level plane2 fl2)
   goals met: 3 of 16
9. (board person8 plane2 city0)
   deleted: (at person8 city0)
   added: (in person8 plane2)
   goals met: 3 of 16
10. (board person13 plane2 city0)
   deleted: (at person13 city0)
   added: (in person13 plane2)
   goals met: 3 of 16
11. (board person2 plane1 city8)
   deleted: (at person2 city8)
   added: (in person2 plane1)
   goals met: 3 of 16
12. (zoom plane1 city8 city3 fl5 fl4 fl3)
   deleted: (at plane1 city8) (fuel-level plane1 fl5)
   added: (at plane1 city3) (fuel-level plane1 fl3)
   goals met: 3 of 16
13. (board person9 plane1 city3)
   deleted: (at person9 city3)
   added: (in person9 plane1)
   goals met: 3 of 16
14. (board person4 plane1 city3)
   deleted: (at person4 city3)
   added: (in person4 plane1)
   goals met: 3 of 16
15. (debark person2 plane1 city3)
   deleted: (in person2 plane1)
   added: (at person2 city3)
   goals met: 4 of 16
16. (zoom plane1 city3 city2 fl3 fl2 fl1)
   deleted: (at plane1 city3) (fuel-level plane1 fl3)
   added: (at plane1 city2) (fuel-level plane1 fl1)
   goals met: 4 of 16
17. (debark person9 plane1 city2)
   deleted: (in person9 plane1)
   added: (at person9 city2)
   goals met: 5 of 16
18. (fly plane1 city2 city5 fl1 fl0)
   deleted: (at plane1 city2) (fuel-level plane1 fl1)
   added: (at plane1 city5) (fuel-level plane1 fl0)
   goals met: 5 of 16
19. (debark person4 plane1 city5)
   deleted: (in person4 plane1)
   added: (at person4 city5)
   goals met: 6 of 16
20. (fly plane3 city12 city1 fl1 fl0)
   deleted: (at plane3 city12) (fuel-level plane3 fl1)
   added: (at plane3 city1) (fuel-level plane3 fl0)
   goals met: 5 of 16
21. (refuel plane3 city1 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 5 of 16
22. (debark person11 plane3 city1)
   deleted: (in person11 plane3)
   added: (at person11 city1)
   goals met: 6 of 16
23. (fly plane3 city1 city12 fl1 fl0)
   deleted: (at plane3 city1) (fuel-level plane3 fl1)
   added: (at plane3 city12) (fuel-level plane3 fl0)
   goals met: 7 of 16
24. (zoom plane2 city0 city10 fl2 fl1 fl0)
   deleted: (at plane2 city0) (fuel-level plane2 fl2)
   added: (at plane2 city10) (fuel-level plane2 fl0)
   goals met: 7 of 16
25. (zoom plane4 city14 city11 fl3 fl2 fl1)
   deleted: (at plane4 city14) (fuel-level plane4 fl3)
   added: (at plane4 city11) (fuel-level plane4 fl1)
   goals met: 7 of 16
26. (board person5 plane4 city11)
   deleted: (at person5 city11)
   added: (in person5 plane4)
   goals met: 7 of 16
27. (refuel plane2 city10 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 7 of 16
28. (debark person8 plane2 city10)
   deleted: (in person8 plane2)
   added: (at person8 city10)
   goals met: 8 of 16
29. (fly plane2 city10 city6 fl1 fl0)
   deleted: (at plane2 city10) (fuel-level plane2 fl1)
   added: (at plane2 city6) (fuel-level plane2 fl0)
   goals met: 8 of 16
30. (refuel plane2 city6 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 8 of 16
31. (debark person13 plane2 city6)
   deleted: (in person13 plane2)
   added: (at person13 city6)
   goals met: 9 of 16
32. (fly plane2 city6 city13 fl1 fl0)
   deleted: (at plane2 city6) (fuel-level plane2 fl1)
   added: (at plane2 city13) (fuel-level plane2 fl0)
   goals met: 9 of 16
33. (refuel plane2 city13 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 9 of 16
34. (board person3 plane2 city13)
   deleted: (at person3 city13)
   added: (in person3 plane2)
   goals met: 9 of 16
35. (fly plane2 city13 city1 fl1 fl0)
   deleted: (at plane2 city13) (fuel-level plane2 fl1)
   added: (at plane2 city1) (fuel-level plane2 fl0)
   goals met: 9 of 16
36. (refuel plane2 city1 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 9 of 16
37. (debark person3 plane2 city1)
   deleted: (in person3 plane2)
   added: (at person3 city1)
   goals met: 10 of 16
38. (fly plane2 city1 city7 fl1 fl0)
   deleted: (at plane2 city1) (fuel-level plane2 fl1)
   added: (at plane2 city7) (fuel-level plane2 fl0)
   goals met: 10 of 16
39. (refuel plane2 city7 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 10 of 16
40. (fly plane4 city11 city0 fl1 fl0)
   deleted: (at plane4 city11) (fuel-level plane4 fl1)
   added: (at plane4 city0) (fuel-level plane4 fl0)
   goals met: 10 of 16
41. (debark person5 plane4 city0)
   deleted: (in person5 plane4)
   added: (at person5 city0)
   goals met: 11 of 16
42. (board person6 plane2 city7)
   deleted: (at person6 city7)
   added: (in person6 plane2)
   goals met: 11 of 16
43. (board person10 plane2 city7)
   deleted: (at person10 city7)
   added: (in person10 plane2)
   goals met: 11 of 16
44. (fly plane2 city7 city8 fl1 fl0)
   deleted: (at plane2 city7) (fuel-level plane2 fl1)
   added: (at plane2 city8) (fuel-level plane2 fl0)
   goals met: 11 of 16
45. (refuel plane2 city8 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 11 of 16
46. (board person12 plane2 city8)
   deleted: (at person12 city8)
   added: (in person12 plane2)
   goals met: 11 of 16
47. (debark person10 plane2 city8)
   deleted: (in person10 plane2)
   added: (at person10 city8)
   goals met: 12 of 16
48. (board person1 plane2 city8)
   deleted: (at person1 city8)
   added: (in person1 plane2)
   goals met: 12 of 16
49. (fly plane2 city8 city9 fl1 fl0)
   deleted: (at plane2 city8) (fuel-level plane2 fl1)
   added: (at plane2 city9) (fuel-level plane2 fl0)
   goals met: 12 of 16
50. (refuel plane2 city9 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 12 of 16
51. (debark person6 plane2 city9)
   deleted: (in person6 plane2)
   added: (at person6 city9)
   goals met: 13 of 16
52. (debark person12 plane2 city9)
   deleted: (in person12 plane2)
   added: (at person12 city9)
   goals met: 14 of 16
53. (fly plane2 city9 city5 fl1 fl0)
   deleted: (at plane2 city9) (fuel-level plane2 fl1)
   added: (at plane2 city5) (fuel-level plane2 fl0)
   goals met: 14 of 16
54. (refuel plane2 city5 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 14 of 16
55. (debark person1 plane2 city5)
   deleted: (in person1 plane2)
   added: (at person1 city5)
   goals met: 15 of 16
56. (fly plane2 city5 city4 fl1 fl0)
   deleted: (at plane2 city5) (fuel-level plane2 fl1)
   added: (at plane2 city4) (fuel-level plane2 fl0)
   goals met: 16 of 16
